In [1]:
import pandas as pd
from scipy import stats

In [2]:
df = pd.read_csv('Datas/pizza_sales.csv')

In [3]:
df.head()

,pizza_id,order_id,pizza_name_id,quantity,order_date,order_time,unit_price,total_price,pizza_size,pizza_category,pizza_ingredients,pizza_name
0,1,1,hawaiian_m,1,1/1/2015,11:38:36,13.25,13.25,M,Classic,"Sliced Ham, Pineapple, Mozzarella Cheese",The Hawaiian Pizza
1,2,2,classic_dlx_m,1,1/1/2015,11:57:40,16.00,16.00,M,Classic,"Pepperoni, Mushrooms, Red Onions, Red Peppers,...",The Classic Deluxe Pizza
2,3,2,five_cheese_l,1,1/1/2015,11:57:40,18.50,18.50,L,Veggie,"Mozzarella Cheese, Provolone Cheese, Smoked Go...",The Five Cheese Pizza
3,4,2,ital_supr_l,1,1/1/2015,11:57:40,20.75,20.75,L,Supreme,"Calabrese Salami, Capocollo, Tomatoes, Red Oni...",The Italian Supreme Pizza
4,5,2,mexicana_m,1,1/1/2015,11:57:40,16.00,16.00,M,Veggie,"Tomatoes, Red Peppers, Jalapeno Peppers, Red O...",The Mexicana Pizza

One Sample T-test

#Is the average total_price of all pizza sales different from $15

In [6]:
'''Workflow-----------
define alpha value(risk limit)
define sample
define column name for sample comparison

testing -> ttest_1samp(column_name,popmean=)
it returns statistics and probablity

print results
compare pvalue and alpha value for correct hypothesis(assumption)
'''

'Workflow-----------\ndefine alpha value(risk limit)\ndefine sample\ndefine column name for sample comparison\n\ntesting -> ttest_1samp(column_name,popmean=)\nit returns statistics and probablity\n\nprint results\ncompare pvalue and alpha value for correct hypothesis(assumption)\n'

In [7]:
alpha = 0.05
sample = 15
total_sales = df['total_price']

In [8]:
t_statistics, pvalue = stats.ttest_1samp(total_sales,popmean=sample)

In [9]:
print(f"Ho: Average total price of all pizza is equal to ${sample}.")
print(f"Ha: Average total price of all pizza is not equal to ${sample}.")
print(f"Statistics:{t_statistics}")
print(f"p-value:{pvalue}")

Ho: Average total price of all pizza is equal to $15.
Ha: Average total price of all pizza is not equal to $15.
Statistics:90.51113970540653
p-value:0.0

In [10]:
if pvalue < alpha:
    print(f"Decision:Failed to accept null Hypothesis.\nConclusion:Accept alternate Hypothesis:Ha: Average total price of all pizza is not equal to $15.")
else:
     print(f"Decision:Failed to reject null Hypothesis.\nConclusion:Accept null Hypothesis:Ha: Average total price of all pizza is not equal to $15.")

Decision:Failed to accept null Hypothesis.
Conclusion:Accept alternate Hypothesis:Ha: Average total price of all pizza is not equal to $15.

In [15]:
#Is average salary of all employees is $5000?

data = pd.read_csv('HR_Dataset Refresh.csv')

In [17]:
data.head()

,Employee_Name,EmpID,MarriedID,MaritalStatusID,GenderID,EmpStatusID,DeptID,PerfScoreID,FromDiversityJobFairID,Salary,...,ManagerName,ManagerID,RecruitmentSource,PerformanceScore,EngagementSurvey,EmpSatisfaction,SpecialProjectsCount,LastPerformanceReview_Date,DaysLateLast30,Absences
0,"Adinolfi, Wilson K",10026,0,0,1,1,5,4,0,62506,...,Michael Albert,22.0,LinkedIn,Exceeds,4.60,5,0,1/17/2019,0,1
1,"Ait Sidi, Karthikeyan",10084,1,1,1,5,3,3,0,104437,...,Simon Roup,4.0,Indeed,Fully Meets,4.96,3,6,2/24/2016,0,17
2,"Akinkuolie, Sarah",10196,1,1,0,5,5,3,0,64955,...,Kissy Sullivan,20.0,LinkedIn,Fully Meets,3.02,3,0,5/15/2012,0,3
3,"Alagbe,Trina",10088,1,1,0,1,5,3,0,64991,...,Elijiah Gray,16.0,Indeed,Fully Meets,4.84,5,0,1/3/2019,0,15
4,"Anderson, Carol",10069,0,2,0,5,5,3,0,50825,...,Webster Butler,39.0,Google Search,Fully Meets,5.00,4,0,2/1/2016,0,2

In [19]:
alp = 0.05
samp = 5000
avg_sal = data['Salary']

In [23]:
T_statistics,p_value = stats.ttest_1samp(avg_sal,popmean=samp)

In [ ]:
print(f"Ho: average salary of all employees is ${samp}")
print(f"Ha: average salary of all employees is not ${samp}")

In [27]:
if p_value > alp:
    print(f"Null hypothesis ins true i.e Ho: average salary of all employees is ${samp}")
else:
    print(f"Alternate hypothesis is true i.e Ha: average salary of all employees is not ${samp}")

Alternate hypothesis is true i.e Ha: average salary of all employees is not $5000